Repository: SkovanskiyS/purchase-number-bot
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru

# start
source: <b>📞 Hello! I am your bot assistant for purchasing virtual numbers!</b> 🔐 Do you want to stay anonymous online or need additional numbers for your business? You've come to the right place! We offer a fast and convenient solution for registering on the OpenAI website and creating new accounts on Telegram. 🌍 Our service supports various countries and operators, so you can choose a number from the desired region. We guarantee complete confidentiality and anonymity of your data. 💳 We have diverse payment methods, including <b>Payme, Click, and QIWI,</b> to make the purchasing process as convenient as possible for you. ❓ If you have any questions or need help feel free to contact me. I am ready to help you at any time.
ru: <b>📞 Привет! Я ваш бот-помощник для покупки виртуальных номеров!</b> 🌍 Наш сервис поддерживает различные страны и операторов, поэтому вы можете выбрать номер из нужного региона. Мы гарантируем полную конфиденциальность и анонимность ваших данных. 💳 У нас есть разнообразные способы оплаты, включая <b>Payme, Click и QIWI,</b> чтобы сделать процесс покупки максимально удобным для вас. ❓ Если у вас возникли вопросы или вам нужна помощь, не стесняйтесь обращаться ко мне. Я готов помочь вам в любое время.

# Choose language:
source: Please choose the language you would like to switch to.
ru: Пожалуйста, выберите язык, на который вы хотите переключиться.

# help
source: <b>Available commands:</b> <i>/start - Begin the process of purchasing virtual numbers. /help - Get information about available commands. /faq - Frequently Asked Questions and answers. /contact - Contact us for assistance and support. /about - Learn about our organization.</i> If you have any questions or issues, feel free to reach out to us. We are ready to help you anytime. <b>Thank you for choosing our Telegram bot for purchasing virtual numbers. We aim to provide you with the best service and security for your online experience.</b>
ru: <b>Список доступных команд:</b><i> /start - Начать процесс покупки виртуальных номеров. /help - Получить справку о доступных командах. /faq - Часто задаваемые вопросы и ответы. /contact - Связаться с нами для получения помощи и поддержки. /about - Узнать информацию о нашей организации.</i> Если у вас возникли какие-либо вопросы или проблемы, не стесняйтесь обращаться к нам. Мы готовы помочь вам в любое время. <b>Спасибо, что выбрали нашего телеграм бота для покупки виртуальных номеров. Мы стремимся предоставить вам лучший сервис и безопасность для вашего онлайн-опыта.</b>

# contact
source: If you have any questions, issues, or need additional assistance, please don't hesitate to contact us. We are always ready to help you! 📧 Email: dynisma.corporation69@gmail.com 📨 Telegram: @dynisma_support Our support specialists will answer your questions and provide the necessary assistance as quickly as possible. Feel free to reach out to us! Thank you for choosing our service. We appreciate your trust and are committed to providing you with the best experience when purchasing virtual numbers. Best regards, <b>Delta Dynisma Team.</b>
ru: Если у вас возникли вопросы, проблемы или вам требуется дополнительная помощь, не стесняйтесь связаться с нами. Мы всегда готовы помочь вам! 📧 Электронная почта: dynisma.corporation69@gmail.co 📨 Телеграм: @dynisma_support Наши специалисты по поддержке ответят на ваши вопросы и предоставят необходимую помощь в кратчайшие сроки. Не стесняйтесь обращаться к нам! Благодарим вас за выбор нашего сервиса. Мы ценим ваше доверие и готовы обеспечить вас лучшим опытом при покупке виртуальных номеров. С уважением Команда <b>Delta Dynisma.</b>

# about
source: <b>Welcome! We are the Delta Dynisma team.</b> We are a startup specializing in software development and various Object-Relational Mapping (ORM) systems. <b>Our goal is to create innovative solutions that help organizations automate processes, improve efficiency, and achieve their business objectives. We offer high-quality software and ORM systems that are reliable, flexible, and scalable.</b> Our team consists of experienced developers who have deep knowledge and skills in programming and software development. We constantly stay updated with the latest trends and technological innovations to provide our clients with modern and effective solutions. <b>We take pride in our achievements and successful projects, helping companies from various industries enhance their productivity and achieve success.</b> If you have any questions or need software development or ORM system implementation, feel free to reach out to us. We are always ready to offer customized solutions that meet your needs. <b>Thank you for choosing Delta Dynisma! We are committed to helping you unleash your potential and achieve your goals. Founders: Masharipov Jaxongir: <i>@o101xd</i></b>
ru: <b>Добро пожаловать! Мы - команда Delta Dynisma. </b> Мы являемся стартапом, специализирующимся на разработке программного обеспечения и различных ORM систем (Object-Relational Mapping). <b>Наша цель - создавать инновационные решения, которые помогают организациям автоматизировать процессы, улучшать эффективность и достигать своих бизнес-целей. Мы предлагаем высококачественные ПО и ORM системы, которые отличаются надежностью, гибкостью и масштабируемостью.</b> Наша команда состоит из опытных разработчиков, которые обладают глубокими знаниями и навыками в области программирования и разработки ПО. Мы постоянно следим за последними тенденциями и технологическими инновациями, чтобы предлагать нашим клиентам современные и эффективные решения. <b>Мы гордимся своими достижениями и успешно реализованными проектами, помогая компаниям разных отраслей повышать свою производительность и достигать успеха.</b> Если у вас есть вопросы, потребности в разработке программного обеспечения или реализации ORM системы, не стесняйтесь обращаться к нам. Мы всегда готовы предложить индивидуальные решения, соответствующие вашим потребностям. <b>Спасибо, что выбрали Delta Dynisma! Мы нацелены на то, чтобы помочь вам реализовать ваш потенциал и достичь ваших целей. Основатели: Masharipov Jaxongir: <i>@o101xd</i></b>

# notification
source: <b>❕ You are in machine state, commands like [/start | /help] will not work.</b>
ru: <b>❕ Вы находитесь в машинном состоянии, команды по типу [/start | /help] не будут работать.</b>

# choose_service
source: 🔽 Choose one of the provided services.
ru: 🔽 Выберите один из заданных сервисов.

# canceled
source: ⛔️ You canceled the order
ru: ⛔️ Вы отменили заказ

# cancel
source: 🚫 Cancel Purchase
ru: 🚫Отменить покупку

# buy_number
source: 📲 Start Shopping
ru: 📲 Начать покупку

# change_lang
source: 🏳️ Language
ru: 🏳️ Язык

# language_changed
source: <b>Great! The language of the bot has been successfully changed.</b>
ru: <b>Отлично! Язык бота успешно изменен.</b>

# choose_country
source: 🌆 Great, now select the country
ru: 🌆 Отлично, теперь выберите страну

# choose_operator
source: 💸 Last step, choose the corresponding price and operator to purchase the number
ru: 💸 Последний шаг, выберите соответствующую цену и оператора для покупки номера

# empty
source: ❌ Unfortunately, this item has been completely sold out.
ru: ❌ К сожалению, данный товар был полностью распродан.

# contact_with
source: 📡 Contact Us
ru: 📡Связаться с нами

# confirm_btn
source: ✅ Confirm
ru: ✅ Подтвердить

# confirm_text
source: ✅ Confirm the data below:
ru: ✅ Подтвердите ниже указанные данные:

# service
source: 1️⃣ Service
ru: 1️⃣ Сервис

# country
source: 2️⃣ Country
ru: 2️⃣ Страна

# operator
source: 3️⃣ Operator
ru: 3️⃣ Оператор

source: 💶 Cost
ru: 💶 Цена

source: 🔄 Quantity
ru: 🔄 Количество

# rate
source: 🌟 Rating
ru: 🌟 Оценка

# choose
source: 💳 Choose your preferred payment method:
ru: 💳 Выберите предпочтительную систему оплаты:

# no_operator
source: ❗️This country does not have any telecom operators.
ru: ️У данной страны отсутствует наличие операторов связи.

source: 🔙 Back
ru: 🔙 Назад

source: 👤 My profile
ru: 👤 Мой профиль

source: 💥 Your name
ru: 💥 Ваше имя

# your_lastname
source: ⚡️ Your surname
ru: ⚡️ Ваше фамилия

# your_language
source: 👅 Selected language
ru: 👅 Выбранный язык

# reg_date
source: 📅 Registration date
ru: 📅 Дата регистрации

# bonus
source: 🌟 Your bonuses
ru: 🌟 Ваши бонусы

# referrals
source: 🖇 The number of your referrals
ru: 🖇 Количество ваших рефералов

# blocked
source: 🚫 Banned
ru: 🚫 Заблокирован

# referral_link
source: 🔗 Your referral link
ru: 🔗 Ваша реферальная ссылка

# pay_text
source: 💰 Pay
ru: 💰 Оплатить

# check_payment
source: ⚠️ Follow the link by clicking on the button <i>Pay</i> <b>✅ After successful payment, click on the confirm button!</b>
ru: ⚠️ Перейдите по ссылке нажав на кнопку <i>Оплатить</i> <b>✅ После успешной оплаты, нажмите на кнопку подтвердить!</b>

# paid
source: ✅Great, the payment has been successful.
ru: ✅Отлично, оплата прошла успешно.

# not_paid
source: ❌ Something went wrong, the payment did not go through. If you paid and received this notification, please contact support!
ru: ❌ Возникла некоторая проблема. Оплата не прошла успешно. Если вы оплатили и получили это уведомление, обратитесь в службу поддержки!

# checking
source: ⏱ We are checking the payment status. Please wait, this process may take a few seconds.
ru: ⏱ Мы проверяем статус платежа. Пожалуйста, подождите, этот процесс может занять несколько секунд.

# get_ref_bonuses
source: ⭐️ Get referral bonuses
ru: ⭐️ Получить бонусы за рефералы

# bonus_changed
source: ✅ Bonuses added successfully
ru: ✅ Бонусы успешно добавлены

# not_enough
source: 💥 Use all points
ru: ❌ У вас недостаточно рефералов

# your_bonuses
source: 🎁 Your total bonuses
ru: 🎁 Ваши набранные бонусы

source: 🎈 Use bonuses
ru: 🎈 Использовать бонусы

# limit
source: ❗️ You have reached the limit
ru: ❗️ Вы достигли лимита

# use_bonus
source: 🌟 Apply bonuses
ru: 🌟 Применить бонусы

# choose_bonus
source: ❗️Sorry, an error has occurred. Please add at least one bonus.
ru: ❗️Извините, произошла ошибка. Пожалуйста, добавьте хотя бы один бонус.

# phone
source: 📱 Phone number
ru: 📱 Номер телефона

# operator_text
source: 📡 Operator
ru: 📡 Оператор

# service_text
source: 🪩 Service
ru: 🪩 Сервис

source: 💸 Price
ru: 💸 Цена

source: 📊 Status
ru: 📊 Статус

source: ⏳ Expires
ru: ⏳ Истекает

# sms
source: 📔 Code | SMS
ru: 📔 Код | СМС

source: 🕔 Created at
ru: 🕔 Создан в

# country_text
source: 🌆 Country
ru: 🌆 Страна

# get_sms_text
source: 📔 Get sms code
ru: 📔 Получить SMS-код

# rebuy_text
source: ♻️ Rebuy
ru: ♻️ Повторная покупка

# cancel_order_text
source: ❌ Cancel
ru: ❌ Отменить

# number_banned
source: 🚫 Banned
ru: 🚫 Заблокирован

# finish_order_text
source: ✅ Complete
ru: ✅ Завершить

# trying_to_get_number
source: Free number will be issued, as soon as appears. Please, wait and don't click anything. Attempt to get number... <b>❗️Note, if you paid and couldn't get any number, please contact support</b>
ru: Свободный номер будет выдан, как только появится. Пожалуйста, подождите и ничего не нажимайте. Попытка получения номера... <b>❗️Внимание, если вы заплатили и не смогли получить любой номер, обратитесь в службу поддержки</b>

# not_finished
source: ❗️️To complete the purchase, you need to receive a confirmation code. Please wait until you receive the code before completing.
ru: ❗️Для завершения покупки требуется получить код подтверждения. Пожалуйста, дождитесь получения кода, прежде чем завершить.

# paid_check
source: <b>✅ Already paid Click on the confirm button!</b>
ru: <b>✅ Уже оплачено Нажмите на кнопку подтвердить!</b>

# finished
source: <b>🎉 Congratulations on your successful purchase! We appreciate your choice and are ready to assist you if you have any questions. Thank you for your trust, and we look forward to a long-term partnership!</b>
ru: <b>🎉 Поздравляем с успешной покупкой! Мы ценим ваш выбор и готовы помочь в случае возникновения вопросов. Спасибо за доверие и надеемся на долгосрочное сотрудничество!</b>

# not_available
source: ❗️🫣 I apologize for the inconvenience, but currently the Click and Qiwi payment systems are not available. Only the Payme service is operational at the moment.
ru: ❗️🫣 Извините за неудобства, но в настоящее время платежные системы Click и Qiwi недоступны. В настоящее время доступен только сервис Payme.

# smth_wrong
source: <b>Failed to get phone number, please contact support!</b>
ru: <b>Не удалось получить номер телефона, обратитесь в службу поддержки!</b>

# faq
source: <b>Before buying, read the tutorial on using the bot</b>: https://telegra.ph/How-to-use-the-bot---BAN-Buy-Activation-Number-07-16
ru: <b>Перед покупкой прочитайте туториал по использованию бота</b>: https://telegra.ph/Kak-polzovatsya-botom---BAN-Buy-Activation-Number-07-16

# cant_cancel
source: ❗️You cannot cancel the order so fast
ru: ❗️Вы не можете отменить заказ так быстро
