commands_text: dict[str:str] = {
    'start': """<b>Привет!</b> Я ваш персональный помощник по покупке виртуальных номеров. Хотите оставаться анонимными в онлайне или нуждаетесь в дополнительных номерах для бизнеса? Вы попали по адресу!

Я могу предложить вам широкий выбор виртуальных номеров, которые можно использовать для регистрации в мессенджерах и OpenAI. Наш сервис предлагает удобные и надежные решения для ваших потребностей.

Что мы предлагаем:
<i>📱 Быстрая и простая покупка виртуальных номеров </i>
<i>🔒 Полная конфиденциальность и анонимность </i>
<i>💬 Поддержка различных стран и операторов</i>
<i>💳 Разнообразные сервисы для оплат (Payme, Click, QIWI)</i>

Как пользоваться:
1️⃣ Выберите сервис, для которой вам нужен номер
2️⃣ Выберите страну
3️⃣ Совершите покупку, следуя инструкциям на экране.
4️⃣ Получите доступ к вашему новому виртуальному номеру и начните его использовать!

Если у вас возникли вопросы или вам нужна помощь, не стесняйтесь обращаться ко мне. Я готов помочь вам в любое время.

Чтобы начать, просто выберите нужную опцию в меню или воспользуйтесь командой /help для получения дополнительной информации.""",

    # -------------------------------------

    'help': """Список доступных команд:

/start - Начать процесс покупки виртуальных номеров.
/help - Получить справку о доступных командах.
/countries - Просмотреть список доступных стран для виртуальных номеров.
/faq - Часто задаваемые вопросы и ответы.
/contact - Связаться с нами для получения помощи и поддержки.

Если у вас возникли какие-либо вопросы или проблемы, не стесняйтесь обращаться к нам. Мы готовы помочь вам в любое время.

Спасибо, что выбрали нашего телеграм бота для покупки виртуальных номеров. Мы стремимся предоставить вам лучший сервис и безопасность для вашего онлайн-опыта.""",


    # --------------------------------------------

    'countries': """""",


    # -------------------------------------------

    'faq':"""<b>Что такое виртуальные номера?</b>
Виртуальные номера - это номера телефонов, которые не связаны с физической SIM-картой. Они позволяют вам получать исходящие и входящие звонки, SMS и использовать их для регистрации в различных онлайн-сервисах.

<b>Какие преимущества виртуальных номеров?</b>
Виртуальные номера предоставляют ряд преимуществ, включая анонимность, защиту личной информации, возможность использования разных номеров для разных целей, таких как онлайн-покупки, регистрация в социальных сетях и других сервисах.

<b>Как я могу использовать виртуальный номер?</b>
Виртуальные номера можно использовать для различных целей, включая регистрацию и верификацию в онлайн-сервисах, получение кодов подтверждения, прием входящих звонков и SMS, а также для поддержания конфиденциальности и анонимности в онлайне.

<b>Каков процесс покупки виртуальных номеров?</b>
Для покупки виртуальных номеров вам нужно выбрать страну, тип номера (временный или постоянный) и выполнить оплату. После этого вы получите доступ к выбранному номеру и можете начать его использование в соответствии с инструкциями, предоставленными вам.

<b>Как долго я могу использовать виртуальный номер?</b>
Срок использования виртуального номера зависит от типа номера, который вы выбираете. Временные номера обычно доступны на определенный период времени (например, несколько дней или недель), а постоянные номера могут использоваться без ограничений.

<b>Какая информация мне потребуется для покупки виртуального номера?</b>
Обычно вам потребуется указать страну, для которой вам нужен виртуальный номер, и выбрать тип номера. В некоторых случаях могут потребоваться дополнительные сведения, например, адрес электронной почты для получения уведомлений.

<b>Как обеспечивается безопасность моей личной информации?</b>
Мы принимаем безопасность и конфиденциальность вашей личной информации очень серьезно. Все данные передаются по зашифрованным каналам, и мы не раскрываем вашу информацию третьим лицам без вашего согласия."""
}

